## diff



<details>
<summary>Diff</summary>

```diff
--- a/examples/complete/plan-target.txt
+++ b/examples/complete/plan-pr.txt
@@ -1,5 +1,325 @@
 
-No changes. Your infrastructure matches the configuration.
+Terraform used the selected providers to generate the following execution
+plan. Resource actions are indicated with the following symbols:
+  + create
 
-Terraform has compared your real infrastructure against your configuration
-and found no differences, so no changes are needed.
+Terraform will perform the following actions:
+
+  # module.data_factory.azurerm_data_factory.main[0] will be created
+  + resource "azurerm_data_factory" "main" {
+      + customer_managed_key_id          = (known after apply)
+      + customer_managed_key_identity_id = (known after apply)
+      + id                               = (known after apply)
+      + location                         = "centralus"
+      + name                             = "adfcoredevcus"
+      + public_network_enabled           = false
+      + resource_group_name              = "rg-core-dev-cus"
+      + tags                             = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "dev"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "core-dev-cus"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-data-factory"
+        }
+
+      + identity {
+          + identity_ids = (known after apply)
+          + principal_id = (known after apply)
+          + tenant_id    = (known after apply)
+          + type         = "UserAssigned"
+        }
+    }
+
+  # module.data_factory.azurerm_data_factory_linked_service_key_vault.main[0] will be created
+  + resource "azurerm_data_factory_linked_service_key_vault" "main" {
+      + data_factory_id = (known after apply)
+      + id              = (known after apply)
+      + key_vault_id    = (known after apply)
+      + name            = "kv-adf-core-dev-cus"
+    }
+
+  # module.data_factory.azurerm_key_vault_key.main[0] will be created
+  + resource "azurerm_key_vault_key" "main" {
+      + curve                   = (known after apply)
+      + e                       = (known after apply)
+      + expiration_date         = "2028-12-31T23:59:59Z"
+      + id                      = (known after apply)
+      + key_opts                = [
+          + "decrypt",
+          + "encrypt",
+          + "sign",
+          + "unwrapKey",
+          + "verify",
+          + "wrapKey",
+        ]
+      + key_size                = 2048
+      + key_type                = "RSA-HSM"
+      + key_vault_id            = (known after apply)
+      + n                       = (known after apply)
+      + name                    = "cmk-key-adf-core-dev-cus"
+      + public_key_openssh      = (known after apply)
+      + public_key_pem          = (known after apply)
+      + resource_id             = (known after apply)
+      + resource_versionless_id = (known after apply)
+      + version                 = (known after apply)
+      + versionless_id          = (known after apply)
+      + x                       = (known after apply)
+      + y                       = (known after apply)
+    }
+
+  # module.data_factory.azurerm_role_assignment.identity_assigned[0] will be created
+  + resource "azurerm_role_assignment" "identity_assigned" {
+      + condition_version                = (known after apply)
+      + id                               = (known after apply)
+      + name                             = (known after apply)
+      + principal_id                     = (known after apply)
+      + principal_type                   = (known after apply)
+      + role_definition_id               = (known after apply)
+      + role_definition_name             = "Key Vault Crypto Service Encryption User"
+      + scope                            = (known after apply)
+      + skip_service_principal_aad_check = (known after apply)
+    }
+
+  # module.data_factory.azurerm_user_assigned_identity.identity[0] will be created
+  + resource "azurerm_user_assigned_identity" "identity" {
+      + client_id           = (known after apply)
+      + id                  = (known after apply)
+      + location            = "centralus"
+      + name                = "midd-adf-core-dev-cus"
+      + principal_id        = (known after apply)
+      + resource_group_name = "rg-core-dev-cus"
+      + tenant_id           = (known after apply)
+    }
+
+  # module.private_dns_zone.azurerm_private_dns_zone.this["azure_data_factory"] will be created
+  + resource "azurerm_private_dns_zone" "this" {
+      + id                                                    = (known after apply)
+      + max_number_of_record_sets                             = (known after apply)
+      + max_number_of_virtual_network_links                   = (known after apply)
+      + max_number_of_virtual_network_links_with_registration = (known after apply)
+      + name                                                  = "privatelink.datafactory.azure.net"
+      + number_of_record_sets                                 = (known after apply)
+      + resource_group_name                                   = "rg-core-dev-cus"
+      + tags                                                  = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "dev"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "core-dev-cus"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-private-dns"
+        }
+
+      + soa_record (known after apply)
+    }
+
+  # module.private_dns_zone.azurerm_private_dns_zone.this["key_vault"] will be created
+  + resource "azurerm_private_dns_zone" "this" {
+      + id                                                    = (known after apply)
+      + max_number_of_record_sets                             = (known after apply)
+      + max_number_of_virtual_network_links                   = (known after apply)
+      + max_number_of_virtual_network_links_with_registration = (known after apply)
+      + name                                                  = "privatelink.vaultcore.azure.net"
+      + number_of_record_sets                                 = (known after apply)
+      + resource_group_name                                   = "rg-core-dev-cus"
+      + tags                                                  = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "dev"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "core-dev-cus"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-private-dns"
+        }
+
+      + soa_record (known after apply)
+    }
+
+  # module.private_dns_zone.azurerm_private_dns_zone_virtual_network_link.this["azure_data_factory-0"] will be created
+  + resource "azurerm_private_dns_zone_virtual_network_link" "this" {
+      + id                    = (known after apply)
+      + name                  = (known after apply)
+      + private_dns_zone_name = "privatelink.datafactory.azure.net"
+      + registration_enabled  = false
+      + resolution_policy     = (known after apply)
+      + resource_group_name   = "rg-core-dev-cus"
+      + tags                  = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "dev"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "core-dev-cus"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-private-dns"
+        }
+      + virtual_network_id    = (known after apply)
+    }
+
+  # module.private_dns_zone.azurerm_private_dns_zone_virtual_network_link.this["key_vault-0"] will be created
+  + resource "azurerm_private_dns_zone_virtual_network_link" "this" {
+      + id                    = (known after apply)
+      + name                  = (known after apply)
+      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
+      + registration_enabled  = false
+      + resolution_policy     = (known after apply)
+      + resource_group_name   = "rg-core-dev-cus"
+      + tags                  = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "dev"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "core-dev-cus"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-private-dns"
+        }
+      + virtual_network_id    = (known after apply)
+    }
+
+  # module.resource_group.azurerm_resource_group.default[0] will be created
+  + resource "azurerm_resource_group" "default" {
+      + id       = (known after apply)
+      + location = "centralus"
+      + name     = "rg-core-dev-cus"
+      + tags     = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "dev"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "core-dev-cus"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-resource-group"
+        }
+
+      + timeouts {
+          + create = "90m"
+          + delete = "90m"
+          + read   = "5m"
+          + update = "90m"
+        }
+    }
+
+  # module.subnet.azurerm_subnet.subnet["subnet1"] will be created
+  + resource "azurerm_subnet" "subnet" {
+      + address_prefixes                              = [
+          + "10.0.1.0/24",
+        ]
+      + default_outbound_access_enabled               = true
+      + id                                            = (known after apply)
+      + name                                          = "subnet1"
+      + private_
```
See the full diff from https://github.com/terraform-az-modules/terraform-azure-data-factory/actions/runs/17626916342

</details>

[GitHub Actions](https://github.com/terraform-az-modules/terraform-azure-data-factory/actions/runs/17626916342)

<!-- diff-action -->
<!-- diff-action/Terraform plan Difference/terraform-plan-diff -->